Revit 2027 API
FabricSheet.CoverOffset Property
 The additional cover offset of the Fabric Sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CoverOffset { get; set; }
Public Property CoverOffset As Double
	Get
	Set
public:
property double CoverOffset {
	double get ();
	void set (double value);
}
member CoverOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for coverOffset is not a number -or- When setting this property: coverOffset is greater then the host thickness.
ArgumentOutOfRangeException |  When setting this property: The given value for coverOffset must be between 0 and 30000 feet.
InvalidOperationException |  When setting this property:
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace